pren-et/bldc/firmware/MC_Library/Lib_Headers/_hcs08/mc9s08jm60.h
/* Based on CPU DB MC9S08JM60_64, version 3.00.049 (RegistersPrg V2.32) */
/*
** ###################################################################
**     Filename  : mc9s08jm60.h
**     Processor : MC9S08JM60CLHE
**     FileFormat: V2.32
**     DataSheet : MC9S08JM60 Rev. 1 11/2007
**     Compiler  : CodeWarrior compiler
**     Date/Time : 5.10.2010, 13:52
**     Abstract  :
**         This header implements the mapping of I/O devices.
**
**     Copyright : 1997 - 2010 Freescale Semiconductor, Inc. All Rights Reserved.
**     
**     http      : www.freescale.com
**     mail      : support@freescale.com
**
**     CPU Registers Revisions:
**      - 26.07.2007, V3.00.0:
**              - Structure of SDIDx register changed for correct support both register names SDID/SDIDL to keep backward compatibility. Bit access removed as it is no meaningfull. 
**      - 8.11.2007, V3.00.1:
**              - Removed USB FIFO registers: FIFO0, F0BADDR, F0SIZE, F0CTL.
**              -   REASON: Changes in data sheet (from Ver 1.0 Draft M to Ver 1.0 Draft N).  
**      - 10.04.2008, V3.00.2:
**              - Removed MCGT register.
**              -   REASON: For factory use only.
**
**     File-Format-Revisions:
**      - 19.07.2007, V2.18 :
**               - Improved number of blanked lines inside register structures
**      - 06.08.2007, V2.19 :
**               - CPUDB revisions generated ahead of the file-format revisions.
**      - 11.09.2007, V2.20 :
**               - Added comment about initialization of unbonded pins.
**      - 02.01.2008, V2.21 :
**               - Changes have not affected this file (because they are related to another family)
**      - 13.02.2008, V2.22 :
**               - Changes have not affected this file (because they are related to another family)
**      - 20.02.2008, V2.23 :
**               - Changes have not affected this file (because they are related to another family)
**      - 03.07.2008, V2.24 :
**               - Added support for bits with name starting with number (like "1HZ")
**      - 28.11.2008, V2.25 :
**               - StandBy RAM array declaration for ANSI-C added
**      - 1.12.2008, V2.26 :
**               - Duplication of bit (or bit-group) name with register name is not marked as a problem, if register is internal only and it is not displayed in I/O map.
**      - 17.3.2009, V2.27 :
**               - Merged bit-group is not generated, if the name matches with another bit name in the register
**      - 6.4.2009, V2.28 :
**               - Fixed generation of merged bits for bit-groups with a digit at the end, if group-name is defined in CPUDB
**      - 3.8.2009, V2.29 :
**               - If there is just one bits group matching register name, single bits are not generated
**      - 10.9.2009, V2.30 :
**               - Fixed generation of registers arrays.
**      - 15.10.2009, V2.31 :
**               - HCS08 family: Bits and bit-groups are published for 16-bit registers: 8-bit overlay registers are required.
**      - 18.05.2010, V2.32 :
**               - MISRA compliance: U/UL suffixes added to all numbers (_MASK,_BITNUM and addresses)
**
**     Not all general-purpose I/O pins are available on all packages or on all mask sets of a specific
**     derivative device. To avoid extra current drain from floating input pins, the user’s reset
**     initialization routine in the application program must either enable on-chip pull-up devices
**     or change the direction of unconnected pins to outputs so the pins do not float.
** ###################################################################
*/

#ifndef _MC9S08JM60_H
#define _MC9S08JM60_H

/*lint -save  -e950 -esym(960,18.4) -e46 -esym(961,19.7) Disable MISRA rule (1.1,18.4,6.4,19.7) checking. */
/* Types definition */
typedef unsigned char byte;
typedef unsigned int word;
typedef unsigned long dword;
typedef unsigned long dlong[2];

/* Watchdog reset macro */
#ifndef __RESET_WATCHDOG
#ifdef _lint
  #define __RESET_WATCHDOG()  /* empty */
#else
  #define __RESET_WATCHDOG() (void)(SRS = 0x55U, SRS = 0xAAU)
#endif
#endif /* __RESET_WATCHDOG */

#define REG_BASE 0x0000                /* Base address for the I/O register block */


#pragma MESSAGE DISABLE C1106 /* WARNING C1106: Non-standard bitfield type */

/**************** interrupt vector numbers ****************/
#define VectorNumber_Vrtc               29U
#define VectorNumber_Viic               28U
#define VectorNumber_Vacmp              27U
#define VectorNumber_Vadc               26U
#define VectorNumber_Vkeyboard          25U
#define VectorNumber_Vsci2tx            24U
#define VectorNumber_Vsci2rx            23U
#define VectorNumber_Vsci2err           22U
#define VectorNumber_Vsci1tx            21U
#define VectorNumber_Vsci1rx            20U
#define VectorNumber_Vsci1err           19U
#define VectorNumber_Vtpm2ovf           18U
#define VectorNumber_Vtpm2ch1           17U
#define VectorNumber_Vtpm2ch0           16U
#define VectorNumber_Vtpm1ovf           15U
#define VectorNumber_Vtpm1ch5           14U
#define VectorNumber_Vtpm1ch4           13U
#define VectorNumber_Vtpm1ch3           12U
#define VectorNumber_Vtpm1ch2           11U
#define VectorNumber_Vtpm1ch1           10U
#define VectorNumber_Vtpm1ch0           9U
#define VectorNumber_VReserved          8U
#define VectorNumber_Vusb               7U
#define VectorNumber_Vspi2              6U
#define VectorNumber_Vspi1              5U
#define VectorNumber_Vlol               4U
#define VectorNumber_Vlvd               3U
#define VectorNumber_Virq               2U
#define VectorNumber_Vswi               1U
#define VectorNumber_Vreset             0U

/**************** interrupt vector table ****************/
#define Vrtc                            0xFFC4U
#define Viic                            0xFFC6U
#define Vacmp                           0xFFC8U
#define Vadc                            0xFFCAU
#define Vkeyboard                       0xFFCCU
#define Vsci2tx                         0xFFCEU
#define Vsci2rx                         0xFFD0U
#define Vsci2err                        0xFFD2U
#define Vsci1tx                         0xFFD4U
#define Vsci1rx                         0xFFD6U
#define Vsci1err                        0xFFD8U
#define Vtpm2ovf                        0xFFDAU
#define Vtpm2ch1                        0xFFDCU
#define Vtpm2ch0                        0xFFDEU
#define Vtpm1ovf                        0xFFE0U
#define Vtpm1ch5                        0xFFE2U
#define Vtpm1ch4                        0xFFE4U
#define Vtpm1ch3                        0xFFE6U
#define Vtpm1ch2                        0xFFE8U
#define Vtpm1ch1                        0xFFEAU
#define Vtpm1ch0                        0xFFECU
#define VReserved                       0xFFEEU
#define Vusb                            0xFFF0U
#define Vspi2                           0xFFF2U
#define Vspi1                           0xFFF4U
#define Vlol                            0xFFF6U
#define Vlvd                            0xFFF8U
#define Virq                            0xFFFAU
#define Vswi                            0xFFFCU
#define Vreset                          0xFFFEU

/**************** registers I/O map ****************/

/*** PTAD - Port A Data Register; 0x00000000 ***/
typedef union {
  byte Byte;
  struct {
    byte PTAD0       :1;                                       /* Port A Data Register Bit 0 */
    byte PTAD1       :1;                                       /* Port A Data Register Bit 1 */
    byte PTAD2       :1;                                       /* Port A Data Register Bit 2 */
    byte PTAD3       :1;                                       /* Port A Data Register Bit 3 */
    byte PTAD4       :1;                                       /* Port A Data Register Bit 4 */
    byte PTAD5       :1;                                       /* Port A Data Register Bit 5 */
    byte             :1; 
    byte             :1; 
  } Bits;
  struct {
    byte grpPTAD :6;
    byte         :1;
    byte         :1;
  } MergedBits;
} PTADSTR;
extern volatile PTADSTR _PTAD @0x00000000;
#define PTAD                            _PTAD.Byte
#define PTAD_PTAD0                      _PTAD.Bits.PTAD0
#define PTAD_PTAD1                      _PTAD.Bits.PTAD1
#define PTAD_PTAD2                      _PTAD.Bits.PTAD2
#define PTAD_PTAD3                      _PTAD.Bits.PTAD3
#define PTAD_PTAD4                      _PTAD.Bits.PTAD4
#define PTAD_PTAD5                      _PTAD.Bits.PTAD5
#define PTAD_PTAD                       _PTAD.MergedBits.grpPTAD

#define PTAD_PTAD0_MASK                 1U
#define PTAD_PTAD1_MASK                 2U
#define PTAD_PTAD2_MASK                 4U
#define PTAD_PTAD3_MASK                 8U
#define PTAD_PTAD4_MASK                 16U
#define PTAD_PTAD5_MASK                 32U
#define PTAD_PTAD_MASK                  63U
#define PTAD_PTAD_BITNUM                0U


