pren-et/bldc/firmware/MC_Library/Lib_Headers/_hcs08/mc9s08jm60.h
/*** NVOPT - Nonvolatile Flash Options Register; 0x0000FFBF ***/
typedef union {
  byte Byte;
  struct {
    byte SEC00       :1;                                       /* Security State Code, bit 0 */
    byte SEC01       :1;                                       /* Security State Code, bit 1 */
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte             :1; 
    byte FNORED      :1;                                       /* Vector Redirection Disable */
    byte KEYEN       :1;                                       /* Backdoor Key Mechanism Enable */
  } Bits;
  struct {
    byte grpSEC0 :2;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
    byte         :1;
  } MergedBits;
} NVOPTSTR;
/* Tip for register initialization in the user code:  const byte NVOPT_INIT @0x0000FFBF = <NVOPT_INITVAL>; */
#define _NVOPT (*(const NVOPTSTR * __far)0x0000FFBF)
#define NVOPT                           _NVOPT.Byte
#define NVOPT_SEC00                     _NVOPT.Bits.SEC00
#define NVOPT_SEC01                     _NVOPT.Bits.SEC01
#define NVOPT_FNORED                    _NVOPT.Bits.FNORED
#define NVOPT_KEYEN                     _NVOPT.Bits.KEYEN
#define NVOPT_SEC0                      _NVOPT.MergedBits.grpSEC0

#define NVOPT_SEC00_MASK                1U
#define NVOPT_SEC01_MASK                2U
#define NVOPT_FNORED_MASK               64U
#define NVOPT_KEYEN_MASK                128U
#define NVOPT_SEC0_MASK                 3U
#define NVOPT_SEC0_BITNUM               0U



/* Flash commands */
#define mBlank                          0x05
#define mBurstProg                      0x25
#define mByteProg                       0x20
#define mMassErase                      0x41
#define mPageErase                      0x40


/***********************************************/
/**   D E P R E C I A T E D   S Y M B O L S   **/
/***********************************************/
/* --------------------------------------------------------------------------- */
/* The following symbols were removed, because they were invalid or irrelevant */
/* --------------------------------------------------------------------------- */



/* **** 24.7.2007 18:33:16 */

#define SPI1DH_Bit8                      This_symb_has_been_depreciated
#define SPI1DH_Bit9                      This_symb_has_been_depreciated
#define SPI1DH_Bit10                     This_symb_has_been_depreciated
#define SPI1DH_Bit11                     This_symb_has_been_depreciated
#define SPI1DH_Bit12                     This_symb_has_been_depreciated
#define SPI1DH_Bit13                     This_symb_has_been_depreciated
#define SPI1DH_Bit14                     This_symb_has_been_depreciated
#define SPI1DH_Bit15                     This_symb_has_been_depreciated
#define SPI1DH_Bit8_MASK                 This_symb_has_been_depreciated
#define SPI1DH_Bit9_MASK                 This_symb_has_been_depreciated
#define SPI1DH_Bit10_MASK                This_symb_has_been_depreciated
#define SPI1DH_Bit11_MASK                This_symb_has_been_depreciated
#define SPI1DH_Bit12_MASK                This_symb_has_been_depreciated
#define SPI1DH_Bit13_MASK                This_symb_has_been_depreciated
#define SPI1DH_Bit14_MASK                This_symb_has_been_depreciated
#define SPI1DH_Bit15_MASK                This_symb_has_been_depreciated
#define SPI1DL_Bit0                      This_symb_has_been_depreciated
#define SPI1DL_Bit1                      This_symb_has_been_depreciated
#define SPI1DL_Bit2                      This_symb_has_been_depreciated
#define SPI1DL_Bit3                      This_symb_has_been_depreciated
#define SPI1DL_Bit4                      This_symb_has_been_depreciated
#define SPI1DL_Bit5                      This_symb_has_been_depreciated
#define SPI1DL_Bit6                      This_symb_has_been_depreciated
#define SPI1DL_Bit7                      This_symb_has_been_depreciated
#define SPI1DL_Bit0_MASK                 This_symb_has_been_depreciated
#define SPI1DL_Bit1_MASK                 This_symb_has_been_depreciated
#define SPI1DL_Bit2_MASK                 This_symb_has_been_depreciated
#define SPI1DL_Bit3_MASK                 This_symb_has_been_depreciated
#define SPI1DL_Bit4_MASK                 This_symb_has_been_depreciated
#define SPI1DL_Bit5_MASK                 This_symb_has_been_depreciated
#define SPI1DL_Bit6_MASK                 This_symb_has_been_depreciated
#define SPI1DL_Bit7_MASK                 This_symb_has_been_depreciated
#define SPI2DH_Bit8                      This_symb_has_been_depreciated
#define SPI2DH_Bit9                      This_symb_has_been_depreciated
#define SPI2DH_Bit10                     This_symb_has_been_depreciated
#define SPI2DH_Bit11                     This_symb_has_been_depreciated
#define SPI2DH_Bit12                     This_symb_has_been_depreciated
#define SPI2DH_Bit13                     This_symb_has_been_depreciated
#define SPI2DH_Bit14                     This_symb_has_been_depreciated
#define SPI2DH_Bit15                     This_symb_has_been_depreciated
#define SPI2DH_Bit8_MASK                 This_symb_has_been_depreciated
#define SPI2DH_Bit9_MASK                 This_symb_has_been_depreciated
#define SPI2DH_Bit10_MASK                This_symb_has_been_depreciated
#define SPI2DH_Bit11_MASK                This_symb_has_been_depreciated
#define SPI2DH_Bit12_MASK                This_symb_has_been_depreciated
#define SPI2DH_Bit13_MASK                This_symb_has_been_depreciated
#define SPI2DH_Bit14_MASK                This_symb_has_been_depreciated
#define SPI2DH_Bit15_MASK                This_symb_has_been_depreciated
#define SPI2DL_Bit0                      This_symb_has_been_depreciated
#define SPI2DL_Bit1                      This_symb_has_been_depreciated
#define SPI2DL_Bit2                      This_symb_has_been_depreciated
#define SPI2DL_Bit3                      This_symb_has_been_depreciated
#define SPI2DL_Bit4                      This_symb_has_been_depreciated
#define SPI2DL_Bit5                      This_symb_has_been_depreciated
#define SPI2DL_Bit6                      This_symb_has_been_depreciated
#define SPI2DL_Bit7                      This_symb_has_been_depreciated
#define SPI2DL_Bit0_MASK                 This_symb_has_been_depreciated
#define SPI2DL_Bit1_MASK                 This_symb_has_been_depreciated
#define SPI2DL_Bit2_MASK                 This_symb_has_been_depreciated
#define SPI2DL_Bit3_MASK                 This_symb_has_been_depreciated
#define SPI2DL_Bit4_MASK                 This_symb_has_been_depreciated
#define SPI2DL_Bit5_MASK                 This_symb_has_been_depreciated
#define SPI2DL_Bit6_MASK                 This_symb_has_been_depreciated
#define SPI2DL_Bit7_MASK                 This_symb_has_been_depreciated


